{
  "translation": {
    "link1": "HOME",
    "link2": "ABOUT ME",
    "link3": "KNOWLEDGE",
    "link4": "PROJECTS",
    "link5": "CONTACTS",

    "apresentation": "Hello, my name is",
    "function": "Front-End Developer",

    "aboutTitle": "About Me",
    "aboutText1": "My name is Lucas Baptista, I'm 20 years old and I have a degree in Systems Analysis and Development from UNIBR - Faculdade de São Vicente.",
    "aboutText2": "Currently, I am looking for my first opportunity in the market as a Front End Developer. I carry with me, in addition to my hard skills, 100% dedication, focus and determination, as being an excellent DEV is the GOAL of my LIFE.",
    "aboutText3": "I have experience with personal projects, such as the sweets e-commerce that I am developing for my mother (Front: Next.js, Tailwind, Jest, Storybook, Redux - Back: Node.js, Express) and I am also a Volunteer Front End Developer in 2 projects in Pipoca Ágil:",
    "aboutTextProject1": "Hepatohub 🟪: An initiative dedicated to raising awareness and preventing liver disease by providing essential information and educational resources to promote liver health.",
    "aboutTextProject2": "SrDente 🦷: A project focused on educating and informing families about the importance of oral health, offering accessible and educational content to encourage dental hygiene practices and preventative care.",

    "knowledgeTitle": "Knowdledges",

    "projectsTitle": "My Projects",


    "projectSubtitle": "Technologies used",
    "projectRepoName": "Repository",

    "project1Title": "Code Connect",
    "project1Desc": "The project was developed to improve my skills with Next.js. I used Next.js, also as a back-end, where I used PostgreSQL to store the data and Prisma to consume the information. As soon as the site is opened, a request is made to the database and for each item a Card is rendered presenting an 'article' about the specific technology. When clicking on 'View Details', the user is directed to a specific page for each post.",

    "project2Title": "Squad Presentation - Pipoca Ágil",
    "project2Desc": "The presentation landing page for Squad Roxo Pastel, from Pipoca Ágil, is a voluntary project that aims to introduce all members and inform about the team's projects. The project was developed by me and two other developers, using React, TypeScript, SASS and the code was versioned using git. In the future, responsiveness and tests will be added.",

    "project3Title": "E-Commerce TCC",
    "project3Desc": "The Ecommerce TCC project was developed using React, TypeScript and styling technologies through SASS modules. Its main purpose was to consolidate my knowledge for presentation to college professors. In addition to design, a valuable aspect of the website is the componentization of graphic elements, the modularization of styles, data typing and the organization and readability of the code.",

    "project4Title": "Secret Friend Raffle",
    "project4Desc": "The project was developed using Jest and Testing Library to improve the practice of unit testing in the application, following the Test Driven Development (TDD) methodology. RecoilJS was used to create information atoms and custom hooks, providing a clear and understandable context for the entire application. React, TypeScript, SASS for page creation and styling. The application's main tests include: Form Test: checks if the input is empty, prevents the addition of new participants, identifies duplicate names and shows error messages when adding a new participant. Participant List Test: covers two scenarios - when the list is empty, it should be displayed without elements, and when it is filled correctly, it shows all participants. The other tests are described in the repository.",

    "project5Title": "E-commerce Hamburgueria",
    "project5Desc": "The project was developed as a challenge for a job interview. The page consists of a burger page where you have the option to buy burgers, where when you add the item to the cart, it will be rendered in the Cart section, loading the number of items and the total value of the cart.",

    "project6Title": "Ecommerce Doces Re e Luk",
    "project6Desc": "The site is being developed based on my insight, with the aim of helping to promote my mother's work in selling sweets, while at the same time training my skills with Next.js, TypeScript, Tailwind, Storybook and Jest in Front-End, and Node.js, Express and MongoDB in the Back-End. I am responsible for all stages of website development, including layout, design, documentation and API. The website will have responsiveness, component unit tests, stories in the Storybook and user validation to perform CRUD operations on the sweets. It is worth noting that the website is still under development and is currently my main project.",

    "contactTitle": "Contact",

    "footerDeveloped": "Website developed by",
    "footerRights": "All rights reserved",

    "modalTitle": "Knowledges of technologie"
  }
}