{
  "translation": {
    "link1": "HOME",
    "link2": "ABOUT ME",
    "link3": "KNOWLEDGE",
    "link4": "PROJECTS",
    "link5": "CONTACTS",

    "contactEmail": "Contact me in E-mail",
    "contactWhatsapp": "Contact me in WhatsApp",

    "apresentation": "Hello, my name is",
    "function": "Front-End Developer",
    "textMain": "Transoform your ideas in ",
    "textMainContrast": "Successful Digital Experiences!",
    "aboutFunction": "Let me help transform your vision into a high-quality web application with a modern, intuitive, and highly performant design. Let's talk about how I can contribute to the success of your project!",


    "aboutTitle": "About Me",
    "aboutText1": "Professional technologist in Systems Analysis and Development and Postgraduate student in Software Engineering, I am a front-end developer passionate about creating impressive and functional interfaces. With expertise in,",
    "aboutTechs": " Next.js, React.js, TypeScript, Node.js and Pipeline CI/CD ",
    "aboutText1_1": "I offer robust and scalable architectures with intuitive, responsive, and attractive design.",
    "aboutText2": "I refine my skills through freelance projects, personal projects, and volunteer work at Pipoca Ágil:",
    "aboutTextProject1": "Hepatohub 🟪: An initiative dedicated to raising awareness and preventing liver disease by providing essential information and educational resources to promote liver health.",
    "aboutTextProject2": "SrDente 🦷: A project focused on educating and informing families about the importance of oral health, offering accessible and educational content to encourage dental hygiene practices and preventative care.",
    "aboutText3": "I am currently seeking my first opportunity in the market as a Front-End Developer. Along with my hard skills, I bring 100% dedication, focus, and determination because ",
    "aboutText3_contrast": " being an excellent developer is the ultimate goal of my life.",

    "knowledgeTitle": "Knowdledges",

    "projectsTitle": "My Projects",


    "projectSubtitle": "Technologies used",
    "projectRepoName": "Repository",

    "projects": [
      {
        "title": "VN Advocacia - Freelance",
        "description": "The project involved freelance development for VN Advocacia, a renowned law firm in Parnaíba, Piauí. The proposal was to create a new website based on their old one, with an improved design, more concise information, an intuitive and harmonious user experience, and functionalities that facilitate contact, either through WhatsApp (with modals and icons linked to the WhatsApp API to start a new conversation) or email (a form that, when submitted, automatically sends an email). Technically, the site is highly componentized to maximize code reuse and is fully documented with Storybook.",
        "img":"projects-assets/vn-advocacia.png",
        "techs": ["React", "TypeScript", "Tailwind", "FramerMotion", "GIT", "Storybook"],
        "deploy": "https://vn-advocacia.vercel.app/",
        "repo": "https://github.com/luscabap/VN-Advocacia",
        "concluido": "true",
        "primario": "true"
      },
      {
        "title": "Dr. Guilherme Andrade - Freelance",
        "description": "The landing page is a freelance project developed for Dr. Guilherme Andrade. The purpose of the site is to present Dr. Guilherme clearly and concisely, highlighting his specialties and areas of expertise. The design was carefully crafted to be attractive and harmonious, making it easy to contact the lawyer, either via WhatsApp or email. The site was developed with a highly componentized architecture to maximize code reuse, features both Dark (default) and Light themes, and is documented in Storybook.",
        "techs": ["Next", "React", "TypeScript", "Tailwind", "FramerMotion", "GIT", "Storybook"],
        "img":"projects-assets/dr-guilherme_andrade.png",
        "deploy": "https://dr-guilherme-andrade.vercel.app/",
        "repo": "https://github.com/luscabap/Guilherme-Andrade",
        "concluido": "true",
        "primario": "false"
      },
      {
        "title": "Mr. Tooth",
        "description": "The Sr.Dente page is a volunteer project developed for Pipoca Ágil. The main objective of the project is to educate and inform families about the importance of oral health, offering accessible and educational content to encourage dental hygiene practices and preventive care. The project guides the exchange of children's baby teeth, addresses oral health in adults, and reinforces the importance of brushing, flossing, and cavity prevention, always in a fun and family-oriented way.",
        "techs": ["React", "TypeScript", "SASS", "GIT", "Storybook"],
        "img":"projects-assets/sr-dente.png",
        "deploy": "https://sr-dente.vercel.app/",
        "repo": "https://github.com/luscabap/sr-dente",
        "concluido": "true",
        "primario": "true"
      },
      {
        "title": "Code Connect",
        "description": "The project was developed to improve my skills with Next.js. I used Next.js, also as a back-end, where I used PostgreSQL to store the data and Prisma to consume the information. As soon as the site is opened, a request is made to the database and for each item a Card is rendered presenting an 'article' about the specific technology. When clicking on 'View Details', the user is directed to a specific page for each post.",
        "techs": ["Next", "TypeScript", "CSS", "GIT", "PostgreSQL", "Prisma"],
        "img":"projects-assets/code-connect.png",
        "deploy": "https://lusca-code-connect.vercel.app/",
        "repo": "https://github.com/luscabap/lusca-code-connect",
        "concluido": "true",
        "primario": "false"
      },
      {
        "title": "E-commerce Hamburgueria",
        "description": "The project was developed as a challenge for a job interview. The page consists of a burger page where you have the option to buy burgers, where when you add the item to the cart, it will be rendered in the Cart section, loading the number of items and the total value of the cart.",
        "techs": ["React", "TypeScript", "StyledComponents", "Redux", "GIT", "Vite"],
        "img":"projects-assets/projeto-hamburgueria.png",
        "deploy": "https://hamburgueria-topaz-seven.vercel.app/",
        "repo": "https://github.com/luscabap/ecommerce-luscabap",
        "concluido": "true",
        "primario": "true"
      },
      {
        "title": "E-commerce Doces Re e Luk",
        "description": "The site is being developed based on my insight, with the aim of helping to promote my mother's work in selling sweets, while at the same time training my skills with Next.js, TypeScript, Tailwind, Storybook and Jest in Front-End, and Node.js, Express and MongoDB in the Back-End. I am responsible for all stages of website development, including layout, design, documentation and API. The website will have responsiveness, component unit tests, stories in the Storybook and user validation to perform CRUD operations on the sweets. It is worth noting that the website is still under development and is currently my main project.",
        "techs": ["Next", "TypeScript", "Tailwind", "Jest", "TestingLibrary", "Storybook", "Node", "Express", "Mongodb"],
        "img":"projects-assets/construcao.png",
        "deploy": "#",
        "repo": "https://github.com/luscabap/ecommerce-luscabap",
        "concluido": "false",
        "primario": "false"
      }
    ],

    "projectButton": "See all projects",

    "contactTitle": "Contact",
    "contactSubtitle": "Send me an e-mail",
    "labelName": "Type your name",
    "placeholderName": "Name",
    "labelEmail": "Type your best e-mail",
    "placeholderEmail": "E-mail",
    "labelNumber": "Type your phone number",
    "placeholderPhoneNumber": "Phone Number",
    "labelSubject": "Type the subject",
    "placeholderSubject": "Subject",
    "labelMessage": "Type the message",
    "placeholderMessage": "Message",
    "submitButton": "Send E-mail",

    "footerDeveloped": "Website developed by",
    "footerRights": "All rights reserved",

    "modalTitle": "Knowledges of technologie"
  }
}