{
  "translation": {
    "link1": "HOME",
    "link2": "SOBRE MIM",
    "link3": "CONHECIMENTOS",
    "link4": "PROJETOS",
    "link5": "CONTATOS",

    "apresentation": "Olá, o meu nome é",
    "function": "Desenvolvedor Front-End",

    "aboutTitle": "Sobre Mim",
    "aboutText1": "Tenho 19 anos de idade e estou cursando o 5° e último semestre de Análise e Desenvolvimento de Sistema na faculdade UNIBR no período noturno e no meu tempo livre estudo as tecnologias voltadas à área de front-end.",
    "aboutText2": "Acredito que o cenário tecnológico mundial está em permanente evolução. Por esse motivo, empenho 110% do meu tempo e energia, uma vez que meu objetivo de vida é seguir minha paixão: a PROGRAMAÇÃO!",

    "knowledgeTitle": "Conhecimentos",

    "projectsTitle": "Meus Projetos",
    

    "projectSubtitle": "Tecnologias usadas",
    "projectRepoName": "Repositório",

    "project1Title": "Code Connect",
    "project1Desc": "O projeto foi desenvolvido para aprimorar minhas habilidades com Next.js. Basicamente, simulei uma API com Json-Server e, ao consumi-la, renderizei cards sobre posts das tecnologias. Ao clicar em 'Ver Detalhes', o usuário é direcionado para uma página específica para cada post.",

    "project2Title": "Apresentação Squad - Pipoca Ágil",
    "project2Desc": "A landing page de apresentação do Squad Roxo Pastel, do Pipoca Ágil, é um projeto voluntário que visa apresentar todos os membros e informar sobre os projetos do time. O projeto foi desenvolvido por mim e mais duas desenvolvedoras, utilizando React, TypeScript, SASS e o código foi versionado utilizando git. Futuramente, serão adicionadas responsividade e testes.",

    "project3Title": "E-Commerce TCC",
    "project3Desc": "O projeto Ecommerce TCC foi desenvolvido utilizando as tecnologias React, TypeScript e estilização através de módulos SASS. Seu principal propósito foi consolidar meus conhecimentos para apresentação aos professores da faculdade. Além do design, um aspecto valioso do site é a componentização dos elementos gráficos, a modularização dos estilos, a tipagem de dados e a organização e legibilidade do código.",

    "project4Title": "Sorteador Amigo Secreto",
    "project4Desc": "O projeto foi desenvolvido utilizando Jest e Testing Library para aperfeiçoar a prática de testes unitários na aplicação, seguindo a metodologia de Desenvolvimento Orientado por Testes (TDD). RecoilJS foi utilizado para criar átomos de informação e hooks personalizados, fornecendo um contexto claro e compreensível para toda a aplicação. React, TypeScript, SASS para criação e estilização da página. Os principais testes da aplicação incluem: Teste do Formulário: verifica se o input está vazio, impede a adição de novos participantes, identifica nomes duplicados e mostra mensagens de erro ao adicionar um novo participante. Teste da Lista de Participantes: cobre dois cenários - quando a lista está vazia, deve ser exibida sem elementos, e quando está preenchida corretamente, mostra todos os participantes. Os demais testes estão descritos no repositório.",

    "project5Title": "E-commerce Hamburgueria",
    "project5Desc": "O projeto foi desenvolvido a fim de um desafio para entrevista de emprego. A página consiste em uma página de hamburgueria onde tem a opção de você comprar hamburguers, onde ao adicionar ao carrinho o item, ele será renderizado na seção de Carrinho, carregando a quantidade de itens e o valor total do carrinho.",

    "project6Title": "Ecommerce Doces Re e Luk",
    "project6Desc": "O site está sendo desenvolvido a partir de um insight meu, com o objetivo de ajudar na divulgação do trabalho da minha mãe na venda de doces, ao mesmo tempo em que treino minhas habilidades com Next.js, TypeScript, Tailwind, Storybook e Jest no Front-End, e Node.js, Express e MongoDB no Back-End. Estou responsável por todas as etapas do desenvolvimento do site, incluindo layout, design, documentação e API. O site terá responsividade, testes unitários dos componentes, histórias no Storybook e validação do usuário para realizar operações CRUD dos doces. Vale destacar que o site ainda está em desenvolvimento e é o meu principal projeto atualmente.",

    "contactTitle": "Contato",

    "footerDeveloped": "Site desenvolvido por",
    "footerRights": "Todos os direitos reservados"
  }
}