{
  "translation": {
    "link1": "HOME",
    "link2": "SOBRE MIM",
    "link3": "CONHECIMENTOS",
    "link4": "PROJETOS",
    "link5": "CONTATOS",

    "apresentation": "Olá, o meu nome é",
    "function": "Desenvolvedor Front-End",

    "aboutTitle": "Sobre Mim",
    "aboutText1": "Chamo-me Lucas Baptista, tenho 20 anos e sou formado em Análise e Desenvolvimento de Sistemas pela UNIBR - Faculdade de São Vicente.",
    "aboutText2": "Atualmente, estou em busca da primeira oportunidade no mercado como Desenvolvedor Front End. Carrego comigo, além das minhas hards skills, uma dedicação, foco e garra de 100%, pois ser um excelente DEV é o OBJETIVO da minha VIDA.",
    "aboutText3": "Tenho experiência com projetos pessoais, como o e-commerce de doces que estou desenvolvendo para a minha mãe (Front: Next.js, Tailwind, Jest, Storybook, Redux - Back: Node.js, Express) e também sou Desenvolvedor Front End Voluntário em 2 projetos no Pipoca Ágil:",
    "aboutTextProject1": "Hepatohub 🟪: Uma iniciativa dedicada à conscientização e prevenção de doenças hepáticas, fornecendo informações essenciais e recursos educacionais para promover a saúde do fígado.",
    "aboutTextProject2": "SrDente 🦷: Um projeto focado em educar e informar famílias sobre a importância da saúde bucal, oferecendo conteúdos acessíveis e didáticos para incentivar práticas de higiene dental e cuidados preventivos.",

    "knowledgeTitle": "Conhecimentos",

    "projectsTitle": "Meus Projetos",
    

    "projectSubtitle": "Tecnologias usadas",
    "projectRepoName": "Repositório",

    "project1Title": "Code Connect",
    "project1Desc": "O projeto foi desenvolvido para aprimorar minhas habilidades com Next.js. Utilizei o Next.js, também como back-end, onde utilizei PostgreSQL para armazenar os dados e Prisma para consumir as informações. Assim que o site é aberto, uma requisição é feita para o banco de dados e para cada item é renderizado um Card apresentando um 'artigo' sobre a tecnologia específica. Ao clicar em 'Ver Detalhes', o usuário é direcionado para uma página específica para cada post.",

    "project2Title": "Apresentação Squad - Pipoca Ágil",
    "project2Desc": "A landing page de apresentação do Squad Roxo Pastel, do Pipoca Ágil, é um projeto voluntário que visa apresentar todos os membros e informar sobre os projetos do time. O projeto foi desenvolvido por mim e mais duas desenvolvedoras, utilizando React, TypeScript, SASS e o código foi versionado utilizando git. Futuramente, serão adicionadas responsividade e testes.",

    "project3Title": "E-Commerce TCC",
    "project3Desc": "O projeto Ecommerce TCC foi desenvolvido utilizando as tecnologias React, TypeScript e estilização através de módulos SASS. Seu principal propósito foi consolidar meus conhecimentos para apresentação aos professores da faculdade. Além do design, um aspecto valioso do site é a componentização dos elementos gráficos, a modularização dos estilos, a tipagem de dados e a organização e legibilidade do código.",

    "project4Title": "Sorteador Amigo Secreto",
    "project4Desc": "O projeto foi desenvolvido utilizando Jest e Testing Library para aperfeiçoar a prática de testes unitários na aplicação, seguindo a metodologia de Desenvolvimento Orientado por Testes (TDD). RecoilJS foi utilizado para criar átomos de informação e hooks personalizados, fornecendo um contexto claro e compreensível para toda a aplicação. React, TypeScript, SASS para criação e estilização da página. Os principais testes da aplicação incluem: Teste do Formulário: verifica se o input está vazio, impede a adição de novos participantes, identifica nomes duplicados e mostra mensagens de erro ao adicionar um novo participante. Teste da Lista de Participantes: cobre dois cenários - quando a lista está vazia, deve ser exibida sem elementos, e quando está preenchida corretamente, mostra todos os participantes. Os demais testes estão descritos no repositório.",

    "project5Title": "E-commerce Hamburgueria",
    "project5Desc": "O projeto foi desenvolvido a fim de um desafio para entrevista de emprego. A página consiste em uma página de hamburgueria onde tem a opção de você comprar hamburguers, onde ao adicionar ao carrinho o item, ele será renderizado na seção de Carrinho, carregando a quantidade de itens e o valor total do carrinho.",

    "project6Title": "Ecommerce Doces Re e Luk",
    "project6Desc": "O site está sendo desenvolvido a partir de um insight meu, com o objetivo de ajudar na divulgação do trabalho da minha mãe na venda de doces, ao mesmo tempo em que treino minhas habilidades com Next.js, TypeScript, Tailwind, Storybook e Jest no Front-End, e Node.js, Express e MongoDB no Back-End. Estou responsável por todas as etapas do desenvolvimento do site, incluindo layout, design, documentação e API. O site terá responsividade, testes unitários dos componentes, histórias no Storybook e validação do usuário para realizar operações CRUD dos doces. Vale destacar que o site ainda está em desenvolvimento e é o meu principal projeto atualmente.",

    "contactTitle": "Contato",

    "footerDeveloped": "Site desenvolvido por",
    "footerRights": "Todos os direitos reservados",

    "modalTitle": "Conhecimentos da tecnologia"
  }
}